In [2]:
import pandas

In [7]:
adopce_zvirat = pandas.read_csv("adopce-zvirat.csv",sep=";")
adopce_zvirat

,id,nazev_cz,nazev_en,trida_cz,cena,k_prohlidce
0,7,Šváb syčivý,Madagascar giant cockroach,Bezobratlí,1000,1
1,8,Pakobylka okřídlená,Pink-winged stick insect,Bezobratlí,1000,1
2,16,Tayra,Tayra,Savci,5000,1
3,35,Kajmanka supí,Alligator snapping turtle,Plazi,2000,1
4,37,Želva žlutočelá,Indochinese box turtle,Plazi,1000,1
...,...,...,...,...,...,...
508,1417,Rosnice šalamounská,,Obojživelníci,1000,1
509,1418,Létavka obecná,,Obojživelníci,1000,1
510,1419,Bažant paví,,Ptáci,1000,1
511,1420,Sojkovec rezavouchý,,Ptáci,1000,1
512,1421,Kachnice kaštanová,,Ptáci,1000,1

In [8]:
adopce_zvirat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 513 entries, 0 to 512
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           513 non-null    int64
 1   nazev_cz     513 non-null    object
 2   nazev_en     513 non-null    object
 3   trida_cz     513 non-null    object
 4   cena         513 non-null    int64
 5   k_prohlidce  513 non-null    int64
dtypes: int64(3), object(3)
memory usage: 24.2+ KB

In [11]:
adopce_zvirat.shape

(513, 6)

In [12]:
adopce_zvirat.columns

Index(['id', 'nazev_cz', 'nazev_en', 'trida_cz', 'cena', 'k_prohlidce'], dtype='object')

In [20]:
adopce_zvirat.iloc[34][['nazev_cz','nazev_en']]

nazev_cz     Ibis bílý
nazev_en    White ibis
Name: 34, dtype: object

In [33]:
cena = adopce_zvirat.sort_values(by=["cena"])

In [35]:
cena.tail(1)

      id      nazev_cz        nazev_en trida_cz   cena  k_prohlidce
128  381  Slon indický  Asian elephant    Savci  50000            1

In [26]:
seznam_cz = adopce_zvirat.sort_values(by=["nazev_cz"])

In [32]:
seznam_cz.tail(1)

       id     nazev_cz                nazev_en trida_cz  cena  k_prohlidce
371  1190  Žluva hajní  Eurasian golden oriole    Ptáci  1000            1

In [29]:
seznam_en = adopce_zvirat.sort_values(by=["nazev_en"])

In [31]:
seznam_en.tail(1)

,id,nazev_cz,nazev_en,trida_cz,cena,k_prohlidce
161,491,Frankolín žlutokrký,Yellow-necked francolin,Ptáci,1000,1